{
  "policyNews": [
    {
      "date": "2025-08-15",
      "category": "Policy Update",
      "headline": "How Pakistani students are reshaping global mobility",
      "description": "Pakistan's large youth population is fuelling a surge in student mobility, with the UK, US and Germany seeing the largest growth, a new report has revealed. The post How Pakistani students are reshaping global mobility appeared first on The PIE News .",
      "source": "thepienews.com",
      "url": "https://thepienews.com/how-pakistani-students-are-reshaping-global-mobility/"
    },
    {
      "date": "2025-08-14",
      "category": "Policy Update",
      "headline": "Many foreign students want to stay in Germany but need more help with the transition to life after study",
      "description": "Early findings from an extensive survey of international students in Germany finds that two-thirds would like to stay and work in Germany after their studies. And that interest is especially concentrated among those studying economics, engineering, and computer science. Roughly half of the surveyed students were also interested in starting a business in Germany. Whatever… The post Many foreign students want to stay in Germany but need more help with the transition to life after study appeared first on ICEF Monitor - Market intelligence for international student recruitment .",
      "source": "monitor.icef.com",
      "url": "https://monitor.icef.com/2025/08/many-foreign-students-want-to-stay-in-germany-but-need-more-help-with-the-transition-to-life-after-study/"
    },
    {
      "date": "2025-08-14",
      "category": "Policy Update",
      "headline": "How post-study work rights can make or break the return on investment for study abroad",
      "description": "The following is a guest post contributed by Tim O’Brien and Claire Clifford from INTO University Partnerships, where Tim is the Senior Vice President, New Partner Development, and Claire the Vice President, Pricing, Insights and Research. According to a 4 June 2025 Wall Street Journal report, international students contribute over US$40 billion to the US… The post How post-study work rights can make or break the return on investment for study abroad appeared first on ICEF Monitor - Market intelligence for international student recruitment .",
      "source": "monitor.icef.com",
      "url": "https://monitor.icef.com/2025/08/how-post-study-work-rights-can-make-or-break-the-return-on-investment-for-study-abroad/"
    },
    {
      "date": "2025-08-14",
      "category": "Policy Update",
      "headline": "US scraps $100m in study abroad programs",
      "description": "The US State Department has removed FY25 funding for at least 22 cultural exchange programs, totalling $100 million in grants already approved by Congress. The post US scraps $100m in study abroad programs appeared first on The PIE News .",
      "source": "thepienews.com",
      "url": "https://thepienews.com/us-scraps-100m-in-study-abroad-programs/"
    },
    {
      "date": "2025-08-14",
      "category": "Policy Update",
      "headline": "Number of Chinese undergrads accepted to UK unis surges by 13%",
      "description": "The number of undergraduate international students getting accepted into UK universities through UCAS has risen by nearly 1,500 in a year – with China, the largest market, growing by 13%. The post Number of Chinese undergrads accepted to UK unis surges by 13% appeared first on The PIE News .",
      "source": "thepienews.com",
      "url": "https://thepienews.com/number-of-chinese-undergrads-accepted-to-uk-unis-surges-by-13/"
    },
    {
      "date": "2025-08-14",
      "category": "Policy Update",
      "headline": "MD 111 brings stability for some but VET sector left behind",
      "description": "Some say Ministerial Direction 111 has improved predictability in student visa processing, but gaps remain for Australia’s vocational sector, audiences at The PIE Live Asia Pacific heard. The post MD 111 brings stability for some but VET sector left behind appeared first on The PIE News .",
      "source": "thepienews.com",
      "url": "https://thepienews.com/md-111-brings-stability-for-some-but-vet-sector-left-behind/"
    },
    {
      "date": "2025-08-14",
      "category": "Policy Update",
      "headline": "Türkiye starts Turkish program for school-aged int’l students",
      "description": "Aiming to host 500,000 international students by 2028, Türkiye has launched a new teaching program to help them learn Turkish. The post Türkiye starts Turkish program for school-aged int’l students appeared first on The PIE News .",
      "source": "thepienews.com",
      "url": "https://thepienews.com/turkiye-starts-turkish-program-for-school-aged-intl-students/"
    },
    {
      "date": "2025-08-13",
      "category": "Policy Update",
      "headline": "Australia prioritises amendments to ESOS Act in legislative agenda",
      "description": "The Australian government has signalled that amendments to the Education Services for Overseas Students (ESOS) Act 2000 are back on the table for 2025/26. The move comes in the wake of the failed attempt to pass The Education Services for Overseas Students Amendment (Quality and Integrity) Bill 2024 last year, a bill that would have formalised… The post Australia prioritises amendments to ESOS Act in legislative agenda appeared first on ICEF Monitor - Market intelligence for international student recruitment .",
      "source": "monitor.icef.com",
      "url": "https://monitor.icef.com/2025/08/australia-prioritises-amendments-to-esos-act-in-legislative-agenda/"
    },
    {
      "date": "2025-08-11",
      "category": "Policy Update",
      "headline": "Study in the UK on a Student visa",
      "description": "Student visa - check which courses you can study, prepare supporting documents, apply, what happens at the UK border",
      "source": "gov.uk",
      "url": "https://www.gov.uk/study-uk-student-visa"
    },
    {
      "date": "2025-08-06",
      "category": "Policy Update",
      "headline": "Guidance: Language analysis: caseworker guidance",
      "description": "Immigration staff guidance on the language analysis process used by the Home Office, how it is accessed and when it should be used to establish place of origin.",
      "source": "gov.uk",
      "url": "https://www.gov.uk/government/publications/language-analysis-instruction"
    },
    {
      "date": "2025-08-06",
      "category": "Policy Update",
      "headline": "UK’s stiffening compliance regime already having an impact on international student recruitment",
      "description": "It would be fair to say that compliance is top of mind for international educators in the United Kingdom these days. The May 2025 immigration white paper from the UK government sets out a number of new requirements for UK institutions, including more stringent compliance thresholds. Those have yet to be implemented but they are… The post UK’s stiffening compliance regime already having an impact on international student recruitment appeared first on ICEF Monitor - Market intelligence for international student recruitment .",
      "source": "monitor.icef.com",
      "url": "https://monitor.icef.com/2025/08/uks-stiffening-compliance-regime-already-having-an-impact-on-international-student-recruitment/"
    },
    {
      "date": "2025-08-06",
      "category": "Policy Update",
      "headline": "Search data highlights surge in student interest in Asian and Middle Eastern destinations at mid-year",
      "description": "Aggregated search data from Keystone Education Group reveals a distinct spike in student interest in destinations across the Middle East and in Asia over the first half of 2025. Hong Kong, Singapore, Taiwan, and South Korea continue to attract greater interest, and each is recording significant gains in Q2 amidst continued policy disruption and/or visa… The post Search data highlights surge in student interest in Asian and Middle Eastern destinations at mid-year appeared first on ICEF Monitor - Market intelligence for international student recruitment .",
      "source": "monitor.icef.com",
      "url": "https://monitor.icef.com/2025/08/search-data-highlights-surge-in-student-interest-in-asian-and-middle-eastern-destinations-at-mid-year/"
    },
    {
      "date": "2025-08-05",
      "category": "Policy Update",
      "headline": "Australia raises enrolment limits for 2025/26 but are they reachable?",
      "description": "A joint 4 August 2025 media release from the Ministers for Education, Home Affairs, Immigration and Citizenship, and Skills and Training, and Assistant Minister for International Education sets out Australia’s National Planning Level (NPL) for the 2025/26 fiscal year. The new NPL will be 295,000 new international student places, an increase of 25,000 over the… The post Australia raises enrolment limits for 2025/26 but are they reachable? appeared first on ICEF Monitor - Market intelligence for international student recruitment .",
      "source": "monitor.icef.com",
      "url": "https://monitor.icef.com/2025/08/australia-raises-enrolment-limits-for-2025-26-but-are-they-reachable/"
    },
    {
      "date": "2025-07-30",
      "category": "Policy Update",
      "headline": "New analysis forecasts international student mobility through 2030",
      "description": "A new analysis from QS maps the major trends and push and pull factors that will shape international student mobility for the rest of this decade. Based on findings from the Global Student Flows Initiative, Three Scenarios for International Education in 2030 explores a series of overlapping, non-exclusive future states for the sector. As the… The post New analysis forecasts international student mobility through 2030 appeared first on ICEF Monitor - Market intelligence for international student recruitment .",
      "source": "monitor.icef.com",
      "url": "https://monitor.icef.com/2025/07/new-analysis-forecasts-international-student-mobility-through-2030/"
    },
    {
      "date": "2025-07-30",
      "category": "Policy Update",
      "headline": "ICEF Podcast: Why cultural intelligence is essential now",
      "description": "Listen in as ICEF’s Craig Riggs and Martijn van de Veen recap some of the latest news and developments in our sector, including the Dutch government’s reversal on plans to limit English-taught degree programmes in the country and New Zealand’s strategy for long-term growth. Our hosts are then joined by an expert panel for a… The post ICEF Podcast: Why cultural intelligence is essential now appeared first on ICEF Monitor - Market intelligence for international student recruitment .",
      "source": "monitor.icef.com",
      "url": "https://monitor.icef.com/2025/07/icef-podcast-why-cultural-intelligence-is-essential-now/"
    }
  ]
}